test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-rsa/1250.log
2025/07/06 21:23:15 Function mode: SINGLE
2025/07/06 21:23:15 RSA_SK is set, using it for encryption
{"level":"info","ts":1751836995.136443,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/06 21:23:15 Starting func invocation probe for target: appender-ego
2025/07/06 21:23:15 Using rate: 1250
Requests      [total, rate, throughput]         375000, 1250.00, 1136.35
Duration      [total, attack, wait]             5m30s, 5m0s, 30.001s
Latencies     [min, mean, 50, 90, 95, 99, max]  5.828ms, 31.502ms, 24.258ms, 57.875ms, 72.032ms, 105.588ms, 30.001s
Bytes In      [total, mean]                     143998080, 383.99
Bytes Out     [total, mean]                     143998080, 383.99
Success       [ratio]                           100.00%
Status Codes  [code:count]                      0:5  200:374995  
Error Set:
Post "http://appender-ego.default.svc.cluster.local": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
2025/07/06 21:28:45 Shutting down InfluxReporter
2025/07/06 21:28:45 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 72.031896ms