test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-rsa/500.log
2025/07/06 21:06:12 Function mode: SINGLE
2025/07/06 21:06:12 RSA_SK is set, using it for encryption
{"level":"info","ts":1751835972.7040887,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/06 21:06:12 Starting func invocation probe for target: appender-ego
2025/07/06 21:06:12 Using rate: 500
2025/07/06 21:11:12 Shutting down InfluxReporter
Requests      [total, rate, throughput]         150000, 500.00, 499.98
Duration      [total, attack, wait]             5m0s, 5m0s, 17.061ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.99ms, 15.625ms, 15.872ms, 19.042ms, 20.919ms, 23.285ms, 209.43ms
Bytes In      [total, mean]                     57600000, 384.00
Bytes Out     [total, mean]                     57600000, 384.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:150000  
Error Set:
2025/07/06 21:11:12 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 20.919459ms